Documents/Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Заказ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтадииДоставкиЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курьер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Курьеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтадииДоставкиЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтадииДоставкиЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПодборКурьера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Начат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставляется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задерживается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Заказ/Forms/МенеджерскаяФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОтменитьЗаказ(Команда)
	ОтменитьЗаказНаСервере();	
	Закрыть();
КонецПроцедуры


&НаСервере
Процедура ОтменитьЗаказНаСервере()   
	Объект.Состояние = Перечисления.СтадииДоставкиЗаказа.Отменен;
	ЭтаФорма.Записать();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.ОтменитьЗаказ.Видимость = НЕ ЭтотЗаказЗавершен() И НЕ Параметры.Ключ.Пустая();
	ЭтаФорма.Элементы.Номер.ТолькоПросмотр = НЕ Параметры.Ключ.Пустая();
	ЭтаФорма.Элементы.Дата.ТолькоПросмотр = НЕ Параметры.Ключ.Пустая();
	ЭтаФорма.Элементы.Магазин.ТолькоПросмотр = НЕ Параметры.Ключ.Пустая();
	ЭтаФорма.Элементы.АдресДоставки.ТолькоПросмотр = НЕ Параметры.Ключ.Пустая();
КонецПроцедуры 
  
&НаКлиенте
Функция ЭтотЗаказЗавершен()
 	Возврат Объект.Состояние = ПредопределенноеЗначение("Перечисление.СтадииДоставкиЗаказа.Доставлен") 
		ИЛИ Объект.Состояние = ПредопределенноеЗначение("Перечисление.СтадииДоставкиЗаказа.Отменен");	
КонецФункции
